In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.DataFrame([[1,2],[4,5]],index=['aa','bb'],columns=['a','b'])

In [3]:
df[0:1]    #索引出第一行的数据

    a  b
aa  1  2

In [4]:
df = pd.DataFrame({'A':[1,2,3],'B':['a','b','f']})

In [5]:
df.loc[[0,1],'B']

0    a
1    b
Name: B, dtype: object

In [6]:
df.nlargest(2,'A')    #根据'A'列数据进行降序排序，返回前两行数据

   A  B
2  3  f
1  2  b

In [7]:
pd.Series([True,False]).any()    #有一个True即返回True，全为False返回False，

True

In [8]:
pd.Series([True,False]).all()     #有一个False即返回False，全为True返回True

False

In [9]:
df.query('A>2')

   A  B
2  3  f

In [10]:
df.columns

Index(['A', 'B'], dtype='object')

In [11]:
df.rename(columns = {'C':[1,2,3]})

   A  B
0  1  a
1  2  b
2  3  f

In [12]:
df1=pd.DataFrame(np.arange(30).reshape(5,6),columns=list('ABCDEF'))

In [13]:
df1

    A   B   C   D   E   F
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29

In [14]:
df1.iloc[:,[1,3,5]]

    B   D   F
0   1   3   5
1   7   9  11
2  13  15  17
3  19  21  23
4  25  27  29

In [15]:
df1 = pd.DataFrame(np.arange(20).reshape(4,5),
                   columns = ['abc','bca','aaa','ddd','abd'])

In [16]:
df1.filter(regex = 'ab[c-d]')

   abc  abd
0    0    4
1    5    9
2   10   14
3   15   19

In [17]:
df = pd.DataFrame(np.arange(12).reshape(3,4),columns = list('ABCD'))

In [18]:
df.loc[(df['A']>3)&(df['C']>6),['B']]

   B
2  9

In [19]:
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [20]:
df1 = pd.DataFrame(np.arange(12).reshape(3,4),columns = list('ABCD'))

In [21]:
df1

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [22]:
df = pd.DataFrame({'A':np.array([np.nan,3,8,5]),
                       'B':np.array([np.nan]*4),
                        'C':1.0})

In [23]:
df

     A   B    C
0  NaN NaN  1.0
1  3.0 NaN  1.0
2  8.0 NaN  1.0
3  5.0 NaN  1.0

In [24]:
df.fillna(5)

     A    B    C
0  5.0  5.0  1.0
1  3.0  5.0  1.0
2  8.0  5.0  1.0
3  5.0  5.0  1.0

In [25]:
df = pd.Series([1,np.nan,np.nan,10,2])

In [26]:
df.fillna(value = 1,limit = 1)

0     1.0
1     1.0
2     NaN
3    10.0
4     2.0
dtype: float64

In [27]:
df.dropna(how = 'any')

0     1.0
3    10.0
4     2.0
dtype: float64

In [28]:
df

0     1.0
1     NaN
2     NaN
3    10.0
4     2.0
dtype: float64

In [29]:
df = pd.DataFrame({'A':np.array([np.nan,3,8,5]),
                       'B':np.array([np.nan]*4),
                        'C':1.0})

In [30]:
df.reindex(columns = list('abc'))

    a   b   c
0 NaN NaN NaN
1 NaN NaN NaN
2 NaN NaN NaN
3 NaN NaN NaN

In [31]:
df = pd.DataFrame(np.arange(9).reshape(3,3),index = list('abc'))

In [32]:
df

   0  1  2
a  0  1  2
b  3  4  5
c  6  7  8

In [33]:
df.reindex(list('abcd'),fill_value = 5)

   0  1  2
a  0  1  2
b  3  4  5
c  6  7  8
d  5  5  5

In [34]:
dates = pd.date_range('20130101',periods = 6)

In [35]:
df = pd.DataFrame(np.random.randn(6,4),index = dates,columns = list('ABCD'))

In [36]:
df.sort_index(axis=1,ascending = False)

                   D         C         B         A
2013-01-01  0.676960 -0.392804  2.099233 -0.375320
2013-01-02 -1.111049 -0.379388  0.318846 -0.080345
2013-01-03 -1.235273  0.030516 -0.624287 -0.065419
2013-01-04 -1.352791 -1.780352 -0.224390  2.042227
2013-01-05  0.602251 -1.058763 -0.783223 -2.249970
2013-01-06  0.378216  1.738436 -1.016768  0.953270

In [37]:
df = pd.DataFrame(np.random.randn(8,4),columns = ['A','B','C','D'])

In [38]:
s = df.iloc[2]

In [39]:
df

          A         B         C         D
0 -0.799360  0.870636  0.564222 -1.464420
1  1.201863 -0.900726  0.171875  0.276701
2 -2.019638 -1.145044 -1.644320  0.023807
3  2.252537 -0.002673  0.607902 -1.549370
4 -0.839402 -0.346059  1.147092  1.311967
5 -0.886333  0.741858 -0.893669 -0.016426
6 -0.039965 -0.665772 -0.599737 -1.915026
7  0.846607 -2.128035 -1.123352  0.996616

In [40]:
s

A   -2.019638
B   -1.145044
C   -1.644320
D    0.023807
Name: 2, dtype: float64

In [41]:
df.append(s,ignore_index = True)

          A         B         C         D
0 -0.799360  0.870636  0.564222 -1.464420
1  1.201863 -0.900726  0.171875  0.276701
2 -2.019638 -1.145044 -1.644320  0.023807
3  2.252537 -0.002673  0.607902 -1.549370
4 -0.839402 -0.346059  1.147092  1.311967
5 -0.886333  0.741858 -0.893669 -0.016426
6 -0.039965 -0.665772 -0.599737 -1.915026
7  0.846607 -2.128035 -1.123352  0.996616
8 -2.019638 -1.145044 -1.644320  0.023807

In [42]:
left = pd.DataFrame({'key': ['foo', 'for'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'fok'], 'rval': [4, 5]})
df = pd.merge(left, right, how='left')

In [43]:
df

   key  lval  rval
0  foo     1   4.0
1  for     2   NaN

In [60]:
df.isnull()

     key   lval   rval
0  False  False  False
1  False  False   True

In [64]:
left = pd.DataFrame({'key':['foo','foo'],'lval':[1,2]})
right = pd.DataFrame({'key':['foo','foo'],'rval':[4,5]})

In [65]:
df1 = pd.merge(left,right,on = 'key')

In [66]:
df1

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [67]:
pd.DataFrame(np.random.rand(10,4))

          0         1         2         3
0  0.707830  0.588589  0.374307  0.702277
1  0.015019  0.989893  0.095405  0.686887
2  0.177437  0.846490  0.339908  0.443947
3  0.351987  0.682857  0.789055  0.116490
4  0.167061  0.211305  0.661320  0.640737
5  0.846553  0.659327  0.907688  0.437330
6  0.985829  0.246801  0.911275  0.953024
7  0.158443  0.235223  0.004192  0.991271
8  0.425309  0.325745  0.658075  0.929127
9  0.503323  0.706785  0.521909  0.051449

In [68]:
df = pd.DataFrame([[4,7,10],[5,8,11],[6,9,12],[6,9,12]],
                 index = [1,2,3,4],columns = list('abc'))

In [69]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12
4  6  9  12

In [70]:
peices = [df[:1],df[1:2],df[2:]]

In [72]:
peices

[   a  b   c
 1  4  7  10,    a  b   c
 2  5  8  11,    a  b   c
 3  6  9  12
 4  6  9  12]

In [73]:
df_single_level_cols = pd.DataFrame([[0,1],[2,3]],
                                   index = ['cat','dog'],
                                   columns = ['weight','height'])

In [74]:
df_single_level_cols    #单级列

     weight  height
cat       0       1
dog       2       3

In [78]:
df_single_level_cols.stack()    #用单个列轴堆叠一个数据框会返回一个序列:

cat  weight    0
     height    1
dog  weight    2
     height    3
dtype: int64

In [80]:
df=pd.DataFrame({'A':['foo','bar','foo','bar','foo','bar','foo','bar'],
            'B':['one','one','two','three','two','two','one','three'],
                'C':np.random.randn(8),
                'D':np.random.randn(8)})

In [81]:
df

     A      B         C         D
0  foo    one  0.156000  1.423279
1  bar    one  2.691794 -1.691626
2  foo    two -1.375972  0.222897
3  bar  three -1.433304 -1.114784
4  foo    two -0.339168 -2.007999
5  bar    two -0.606871  0.421946
6  foo    one  0.962870 -0.642767
7  bar  three -0.809603 -0.163554

In [82]:
df.groupby('A').sum()

            C         D
A
bar -0.157984 -2.548018
foo -0.596270 -1.004590

In [84]:
df=pd.DataFrame({'A':['dog','dog','cat','cat','dog','dog'],
              'B':['like','dislike','like','dislike','like','like'],
                 'C':np.random.rand(6)})

In [85]:
df

     A        B         C
0  dog     like  0.489610
1  dog  dislike  0.003417
2  cat     like  0.033037
3  cat  dislike  0.482083
4  dog     like  0.876621
5  dog     like  0.064146

In [86]:
df.groupby(['A','B']).mean()

                    C
A   B
cat dislike  0.482083
    like     0.033037
dog dislike  0.003417
    like     0.476792

In [87]:
df = pd.DataFrame(np.random.randn(3,4),columns = list('ABCD'))

In [88]:
df

          A         B         C         D
0 -2.291973  1.018202 -0.024695 -0.664147
1 -2.220457 -1.181841  0.852658 -2.567898
2  1.110815  1.572090  0.792899  1.270278

In [89]:
s=pd.Series([1,2,3,np.nan,5])

In [90]:
s.dtype

dtype('float64')

In [94]:
df = pd.DataFrame({'A':1.0,'B':'abc','C':2,'D':pd.Timestamp('20130102')},index = (1,2,3))

In [95]:
df

     A    B  C          D
1  1.0  abc  2 2013-01-02
2  1.0  abc  2 2013-01-02
3  1.0  abc  2 2013-01-02

In [96]:
df.dtypes

A           float64
B            object
C             int64
D    datetime64[ns]
dtype: object

In [97]:
df = pd.DataFrame({'A': range(1, 11), 'B': np.random.randn(10)})

In [100]:
pd.qcut(df.A,2,labels = False)

0    0
1    0
2    0
3    0
4    0
5    1
6    1
7    1
8    1
9    1
Name: A, dtype: int64

In [101]:
df.A

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: A, dtype: int64